Repository: yqZhang4480/HighestSearch
Catalog: Strings/*/Resources.resw
Source language: en
Languages: zh_hans

# About.Text
source: About
zh_hans: 关于应用

# AddTab.Content
source: Add search site
zh_hans: 添加搜索项

# AppName
source: Union-Find Sets
zh_hans: 并查集

# Back.ToolTipService.ToolTip
source: Go back
zh_hans: 后退

# CurrentTab.Text
source: Current search site
zh_hans: 当前搜索项

# DeleteButton.Content
source: Delete
zh_hans: 删除

# DeleteHalf.Content
source: Delete half
zh_hans: 删除一半记录

# DeleteHalfHistory.Content
source: Confirm to delete the last half of the records
zh_hans: 确认删除后面一半的记录

# DeleteHalfHistoryNotice.Text
source: Records that are not displayed in the list may also be deleted.
zh_hans: 未在该列表中显示的记录也可能会被删除。

# DeleteSelected.Content
source: Delete selected
zh_hans: 删除选中记录

# DeleteSelectedHistory.Content
source: Confirm to delete the selected records
zh_hans: 确认删除选中记录

# DeleteUnselected.Content
source: Delete unselected
zh_hans: 删除未选中记录

# DeleteUnselectedHistory.Content
source: Confirm to delete all unselected records
zh_hans: 确认删除所有未选中记录

# DeleteUnselectedHistoryNotice.Text
source: Records that are not displayed in the list may also be deleted.
zh_hans: 未在该列表中显示的记录也会被删除。

# EditTab.Text
source: Modify the search site selected on the left.
zh_hans: 在左边选择一个搜索项，然后修改其信息。

# FlyoutBack.Text
source: Go back
zh_hans: 后退

# FlyoutForward.Text
source: Go forward
zh_hans: 前进

# FlyoutHistory.Text
source: History
zh_hans: 历史记录

# FlyoutOpenLinkBar.Text
source: Address Bar
zh_hans: 地址栏

# FlyoutOpenOutside.Text
source: Open in your browser
zh_hans: 在浏览器打开

# FlyoutRefresh.Text
source: Refresh
zh_hans: 刷新

# FlyoutSettings.Text
source: Settings
zh_hans: 选项

# FlyoutWVTabs.Text
source: Tabs
zh_hans: 标签页

# Forward.ToolTipService.ToolTip
source: Go forward
zh_hans: 前进

# FullScreenButton.ToolTipService.ToolTip
source: Enter full screen
zh_hans: 全屏

# GotoStore.Text
source: Review our app in Microsoft Store
zh_hans: 去应用商店评价

# GotoTabManage.Content
source: Manage search sites
zh_hans: 管理搜索项

# History.ToolTipService.ToolTip
source: History
zh_hans: 历史记录

# HistoryNum.Text
source: No result.
zh_hans: 未选取任何内容。

# HistoryNumResults
source: result(s) listed
zh_hans: 条符合条件的记录。

# HistorySearchBar.PlaceholderText
source: Search in history
zh_hans: 在历史记录中筛选

# HistoryTitle.Text
source: History
zh_hans: 历史记录

# Message_AccessFailed
source: An error occurred in accessing this site. Message:
zh_hans: 访问时出现错误。信息：

# Message_CannotResolve_Item
source: Can't resolve the URL, Please fix the search site.
zh_hans: 无法解析网址，请修正搜索项。

# Message_CannotResolve_LinkBar
source: Can't resolve the URL, Please fix the URL in the address bar.
zh_hans: 无法解析网址，请修正地址栏。

# Message_CannotResolve_Unknown
source: Unknown error occurred in URL parsing, please try to correct the URL.
zh_hans: 网址解析出现了未知的错误，请尝试修正网址。

# Message_HistoryTooMuch
source: Too many history records would affect the performance of the application, please clean them up in time.
zh_hans: 历史记录过多会影响程序的运行速度，请及时清理。

# Message_Unsafe
source: This site is not secure. The password and other sensitive information entered on this page may be leaked.
zh_hans: 此站点不安全。在此页面输入的密码等敏感信息有泄露的可能。

# Message_Unsupport_Content
source: Content not supported by this app (such as downloading files, etc.) was detected. You can open this page in your browser.
zh_hans: 检测到此应用不支持的内容（如下载文件等）。您可以选择在浏览器打开此网页。

# Message_Unsupport_URI
source: This type of URI is not supported. You can open this page in your browser.
zh_hans: 不支持此类URI。您可以选择在浏览器打开此页面。

# MoreFunctions.ToolTipService.ToolTip
source: More
zh_hans: 更多

# MoveDownButton.Content
source: Move down
zh_hans: 下移

# MoveUpButton.Content
source: Move up
zh_hans: 上移

# OpenLinkBar.ToolTipService.ToolTip
source: Address bar
zh_hans: 地址栏

# OpenOutside.ToolTipService.ToolTip
source: Open in your browser
zh_hans: 在浏览器打开

# Refresh.ToolTipService.ToolTip
source: Refresh
zh_hans: 刷新

# SaveButton.Content
source: Save
zh_hans: 保存

# SearchBar.PlaceholderText
source: Enter your search text and press Enter
zh_hans: 输入搜索内容，按Enter键发起搜索

# SearchBarVisualStateSetter_Small.Value
source: Enter your search text
zh_hans: 输入搜索内容

# SearchHistoryRB.Content
source: Searching
zh_hans: 搜索记录

# Settings.ToolTipService.ToolTip
source: Settings
zh_hans: 选项

# SettingTitle.Text
source: Settings
zh_hans: 选项

# Suggest.Text
source: Input suggestions
zh_hans: 输入建议

# SuggestToggleSwitchContent.Header
source: Provide advice based on history.
zh_hans: 提供基于历史记录的建议。

# SuggestToggleSwitchContent.OffContent
source: OFF
zh_hans: 关

# SuggestToggleSwitchContent.OnContent
source: ON
zh_hans: 开

# TabHome.Text
source: Address (no search text)
zh_hans: 网址（无搜索文本时）

# TabManageTitle.Text
source: Search sites
zh_hans: 搜索项

# TabName.Text
source: Name
zh_hans: 名称

# TabNotice.Text
source: Address should start with http: or https:.
zh_hans: 网址应以https:或http:开头。

# TabUrl1.Text
source: Address (before search text)
zh_hans: 网址（搜索文本之前）

# TabUrl2.Text
source: Address (behind search text)
zh_hans: 网址（搜索文本之后）

# UA.Text
source: User Agents
zh_hans: 浏览器标识（UA）

# UAwords1.Text
source: Select the user agent that the app uses.
zh_hans: 选择应用使用的浏览器标识。

# UAwords2.Text
source: refresh the page when it is inconsistent.
zh_hans: 此项不适用于内部跳转链接， 不一致时请尝试刷新页面。

# ViewHistoryRB.Content
source: Browsing
zh_hans: 浏览记录

# WVTabs.ToolTipService.ToolTip
source: Tabs
zh_hans: 标签页
